Tekla Open API Reference for Tekla Structures 2025
CustomPartPositioningTypeAttribute Class
 The CustomPartInputTypeAttribute class is used for defining the input type. Based on the type the system will then position the custom part either based on calculated extrema center point or given input points. The attribute is initialized from the custom attribute i.e. [CustomPartPositioningType((CustomPartBase.CustomPartPositioningType.POSITIONING_BY_INPUTPOINTS)] in the custom part source code.
Inheritance Hierarchy
System.Object
 System.Attribute
 Tekla.Structures.Plugins.CustomPartPositioningTypeAttribute
 Namespace: Tekla.Structures.Plugins
 Assembly: Tekla.Structures.Plugins (in Tekla.Structures.Plugins.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class CustomPartPositioningTypeAttribute : Attribute
Public NotInheritable Class CustomPartPositioningTypeAttribute
	Inherits Attribute
The CustomPartPositioningTypeAttribute type exposes the following members.
Constructors
Name | Description
CustomPartPositioningTypeAttribute(Int32)
 The custom attribute uses this to store the positioning type to the system. This is not to be used by itself.
CustomPartPositioningTypeAttribute(CustomPartBase.CustomPartPositioningType)
 The custom attribute uses this to store the positioning type to the system. This is not to be used by itself.
Top
Properties
Name | Description
Type
 The custom attribute uses this to store the positioning type to the system. This is not to be used by itself.
Top
See Also
Reference
Tekla.Structures.Plugins Namespace